In [5]:
import pandas as pd
file = "../DATA/movies.csv"

# 1.3 판다스 돌러보기

인덱스 레이블은 데이터 행의 식별자 역할로 모든 열이 식별자 역할 설정 가능

In [6]:
pd.read_csv(file)

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

In [10]:
movies = pd.read_csv(file, index_col = "Title")
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

## 1.3.2 DataFrame 조작

In [12]:
movies.head(4)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [15]:
movies.tail()

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [17]:
len(movies)

782

In [19]:
movies.shape

(782, 4)

In [20]:
movies.size

3128

In [21]:
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

인덱스 위치 = 행의 숫자 / 순서에 따른 데이터셋 행 추출

In [24]:
# 500번째 인덱스 위치 선택하기
movies.iloc[499] 
# -> 1차원 배열인 Series라는 새 객체 반환
# Series의 '인덱스 레이블'은 DF의 'col'인 (Rank, Studio, Gross, Year)
# 판다스가 기존의 행 값을 열로 변경하여 표시

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [25]:
movies.loc["Forrest Gump"]

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [26]:
movies.loc["101 Dalmatians"]

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

In [33]:
# 최근 개봉 영화 순서로 보고 싶다면?
movies.sort_values(by=["Year"], ascending = False).head()

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

In [30]:
movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

## 1.3.3 Series의 값 계산

In [35]:
movies["Studio"]
# 영화 제목을 Series로 갖고 있음

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [37]:
movies["Studio"].value_counts().head()

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: count, dtype: int64

## 1.3.4 하나 이상의 기준으로 열 필터링
    - 하나 이상의 기준에 따라 행의 하위 집합을 추출해야 하는 경우

In [38]:
# Universal에서 제작한 영화만 찾기
movies[movies["Studio"] == "Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [39]:
(movies["Studio"] == "Universal")

Title
Avengers: Endgame               False
Avatar                          False
Titanic                         False
Star Wars: The Force Awakens    False
Avengers: Infinity War          False
                                ...
Yogi Bear                       False
Garfield: The Movie             False
Cats & Dogs                     False
The Hunt for Red October        False
Valkyrie                        False
Name: Studio, Length: 782, dtype: bool

In [41]:
StudioTF = (movies["Studio"] == "Universal")
movies[StudioTF]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

유니버셜에서 제작하고 2015년에 개봉한 영화

In [42]:
StudioTF = (movies["Studio"] == "Universal")
YearTF = (movies["Year"] == 2015)
movies[StudioTF & YearTF]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [44]:
type(movies["Year"] == 2015)

pandas.core.series.Series

In [50]:
# 1983년~1986년에 개봉한 영화
YearTF = (movies["Year"]<=1986)
YearTF2 = (movies["Year"]>=1983)
movies[YearTF & YearTF2]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [51]:
# 1983년~1986년에 개봉한 영화
YearTF = ((movies["Year"]<=1986)&(movies["Year"]>=1983)) 
movies[YearTF]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [53]:
# 1983년~1986년에 개봉한 영화
YearTF = (movies["Year"]<=1986 & movies["Year"]>=1983) 
movies[YearTF]
# ambiguous = 모호한 즉, 괄호가 없어서 연산 순서가 모호해짐!! 위에 셀처럼 명확하게 표기할 것

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [57]:
YearTF = (movies["Year"].between(1983, 1986)) 
movies[YearTF]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

## 1.3.5 데이터 그룹화

In [59]:
# 어떤 제작사가 제작한 영화의 총수익이 가장 높은지 알아보기!!
movies["Gross"] # data type이 object -> $와 ,를 없애야함

Title
Avengers: Endgame               $2,796.30
Avatar                          $2,789.70
Titanic                         $2,187.50
Star Wars: The Force Awakens    $2,068.20
Avengers: Infinity War          $2,048.40
                                   ...
Yogi Bear                         $201.60
Garfield: The Movie               $200.80
Cats & Dogs                       $200.70
The Hunt for Red October          $200.50
Valkyrie                          $200.30
Name: Gross, Length: 782, dtype: object

In [87]:
movies["Gross"].str.replace("$", "", regex = False) # object라서 형변환은 필요없음!! 단지 str메서드가 필요한 것같음

Title
Avengers: Endgame               2,796.30
Avatar                          2,789.70
Titanic                         2,187.50
Star Wars: The Force Awakens    2,068.20
Avengers: Infinity War          2,048.40
                                  ...
Yogi Bear                         201.60
Garfield: The Movie               200.80
Cats & Dogs                       200.70
The Hunt for Red October          200.50
Valkyrie                          200.30
Name: Gross, Length: 782, dtype: object

In [88]:
movies["Gross"].replace("$2,796.30 ", "뿅", regex = False) 
# str.replace = 일부 일치
# replace = 전체 일치

Title
Avengers: Endgame                        뿅
Avatar                          $2,789.70
Titanic                         $2,187.50
Star Wars: The Force Awakens    $2,068.20
Avengers: Infinity War          $2,048.40
                                   ...
Yogi Bear                         $201.60
Garfield: The Movie               $200.80
Cats & Dogs                       $200.70
The Hunt for Red October          $200.50
Valkyrie                          $200.30
Name: Gross, Length: 782, dtype: object

In [89]:
movies["Gross"].str.replace("$", "", regex = False)

Title
Avengers: Endgame               2,796.30
Avatar                          2,789.70
Titanic                         2,187.50
Star Wars: The Force Awakens    2,068.20
Avengers: Infinity War          2,048.40
                                  ...
Yogi Bear                         201.60
Garfield: The Movie               200.80
Cats & Dogs                       200.70
The Hunt for Red October          200.50
Valkyrie                          200.30
Name: Gross, Length: 782, dtype: object

In [105]:
# movies["Gross"] = movies["Gross"].str.replace("$", "", regex = False).str.replace(",", "", regex = False,).astype(float)
movies.dtypes # 홍홍 나중에 돌릴 때 윗줄 주석 풀기

Rank        int64
Studio     object
Gross     float64
Year        int64
dtype: object

In [103]:
movies["Gross"].mean()

439.0308184143222

In [107]:
# 스튜디오 별로 그룹화
studios = movies.groupby("Studio")
studios["Gross"].count().head()

Studio
Artisan                     1
Buena Vista               125
CL                          1
China Film Corporation      1
Columbia                    5
Name: Gross, dtype: int64

In [109]:
# 제작사별 Gross 열의 값을 추가합니다.
studios["Gross"].sum().head()

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64